#!/bin/bash
   # Αυτό το script υπολογίζει τον απλό τόκο δεδομένου του κεφαλαίου,
   # του ετήσιου επιτοκίου και της χρονικής περιόδου σε χρόνια.
   # Μην το χρησιμοποιείτε σε παραγωγή. Μόνο για δείγμα.
   # Author: Upkar Lidder (IBM)
   # Additional Authors:
   # <το όνομα χρήστη σας στο GitHub>
   # Είσοδος:
   # p, ποσό κεφαλαίου
   # t, χρονική περίοδος σε χρόνια
   # r, ετήσιο επιτόκιο
   # Έξοδος:
   # απλός τόκος = p*t*r
   echo "Εισάγετε το κεφάλαιο:"
   read p
   echo "Εισάγετε το επιτόκιο ανά έτος:"
   read r
   echo "Εισάγετε τη χρονική περίοδο σε χρόνια:"
   read t
   s=`expr $p \* $t \* $r / 100`
   echo "Ο απλός τόκος είναι: "
   echo $s
